package day004;

public class Ex11_HomeWork {

	public static void main(String[] args) {
		/*다음과 같이 실행되도록 프로그램을 작성하세요.
		 * *******메뉴*******
		 * 1.UpDown 게임 실행
		 * 2. 최고기록 확인
		 * 3. 프로그램 종료
		 * ****************
		 * 메뉴선택: 2
		 * 게임을 실행한 기록이 없습니다.
		 * *******메뉴*******
		 * 1.UpDown 게임 실행
		 * 2. 최고기록 확인
		 * 3. 프로그램 종료
		 * ****************
		 * 메뉴선택: 1
		 * 입력: 50
		 * Down!
		 * 입력: 25
		 * 정답!
		 * *******메뉴*******
		 * 1.UpDown 게임 실행
		 * 2. 최고기록 확인
		 * 3. 프로그램 종료
		 * ****************
		 * 메뉴선택: 2
		 * 2회
		 * 메뉴로 돌아가려면 엔터를 입력하세요.
		 * 메뉴
		 * *******메뉴*******
		 * 1.UpDown 게임 실행
		 * 2. 최고기록 확인
		 * 3. 프로그램 종료
		 * ****************
		 * 메뉴선택: 3
		 * 프로그램을 종료합니다.
		 * */
		
	}

}
