package homework.ex2;

import lombok.Data;

@Data
public class StudentMain {

	public static void main(String[] args) {
		/*
		 * 학생성적관리 프로그램을 작성하세요.
		 * 1. 학생 등록
		 * 	- 학년, 반, 번호를, 이름을 입력받아 등록
		 * 	- 이미 등록한 학생 정보(학년, 반, 번호 일치)라면 등록하지 않음
		 * 2. 학생 수정
		 * 	- 학년, 반, 번호를 입력받아 학생이 있는지 찾고, 있으면 수정
		 * 	- 이미 등록된 학생 정보와 일치하면 수정하지 않음
		 * 3. 학생 삭제
		 * 	- 학년, 반, 번호를 입력받아 학생이 있는지 찾고, 있으면 삭제
		 * 4. 과목 등록
		 * 	- 학년, 학기, 과목명을 입력받아 없으면 등록
		 * 5. 과목 수정
		 * 	- 학년, 학기, 과목명을 입력받아 있으면 학년, 학기, 과목명을 입력받아 수정
		 * 	- 이미 등록된 과목명과 일치하면 수정하지 않음
		 * 6. 과목 삭제
		 * 	- 학년, 학기, 과목명을 입력받아 있으면 삭제
		 * 7. 성적 등록
		 * 	- 학년, 반, 번호를 입력받아 학생을 찾음
		 * 	- 있으면 과목명을 출력
		 * 	- 과목명을 선택
		 * 	- 성적을 입력해서 학생 성적을 등록
		 * 8. 성적 수정
		 * 	- 학년, 반, 번호를 입력받아 학생을 찾음
		 * 	- 있으면 학년, 학기, 과목명을 입력받고 있으면 성적을 입력받아 수정
		 * 9. 성적 삭제
		 * 	- 학년, 반, 번호를 입력받아 학생을 찾음
		 * 	- 있으면 학년, 학기, 과목명을 입력받고 있으면 삭제
		 * 10. 학생 조회
		 * 	- 학년, 반을 입력하면 학생들을 조회
		 * 11. 과목 조회
		 * 	- 등록된 과목 전체를 조회
		 * 12. 성적 조회
		 * 	- 학년, 반, 번호를 입력받아 있으면 학생 성적을 조회
		 * */
		
		Student[] stdList;
		
	}

}
